{
  "Sanghani Center": {
    "jobTitle": "Undergraduate Research Assistant @",
    "duration": "Feb 2023 - May 2023",
    "location": "Blacksburg, VA",
    "desc": [
      "Developed a robust Learning Management System for students using Next.js, React, Auth0, AWS DynamoDB, and Prismic CMS.",
      "Managed AWS DynamoDB database for storing and retrieving user metadata, course progress, grade level, date of birth, and other information with 99% uptime, low latency, and high throughput.",
      "Incorporated Prismic CMS for administrators to create and publish content to the application, resulting in a 50% reduction in the time to create and publish course content."
    ]
  },
  "Data & Algorithm Analysis": {
    "jobTitle": "Undergraduate Teaching Assistant @",
    "duration": "Jan 2023 - May 2023",
    "location": "Blacksburg, VA",
    "desc": [
      "Designed grading rubrics and evaluated student assignments collaboratively with a 6-member team of 130+ students.",
      "Delivered over 10 hours of one-on-one support to students each week, resulting in a 25% increase in assignment completion rates."
    ]
  },
  "Collaborative Robotics Laboratory": {
    "jobTitle": "Machine Learning Research Intern @",
    "duration": "May 2022 - August 2022",
    "location": "Blacksburg, VA",
    "desc": [
      "Trained and fine-tuned hyperparameters of state-of-the-art object detection architecture YOLOv5s6 model on a custom dataset using transfer learning for real-time detection with 80-95% accuracy to assist robot arm movement.",
      "Modeled python scripts to localize 2D pixels to 3D real-world coordinates and automated synthetic dataset creation of YCB-dataset objects for real-time detection at 140+ FPS with YOLOv5 PyTorch labels granting time efficiency to improve by 90%."
    ]
  },
  "Hokie Electric Vehicle Team": {
    "jobTitle": "Connected and Automated Vehicles Sub Team Member @",
    "duration": "January 2022 - May 2023",
    "location": "Blacksburg, VA",
    "desc": [
      "Competed in the EcoCAR EV Challenge competition sponsored by the U.S. Department of Energy, General Motors, and MathWorks – validated by achieving SAE L2+ automation in the 2023 Cadillac LYRIQ.",
      "Designed a Kalman filter-based sensor fusion algorithm to streamline sensor data and enhance the performance of 4+ stock sensors in Software-in-Loop simulation, resulting in 80% accurate MIO assignment and 90% reduced object detection errors."
    ]
  },
  "Teaching Robotics and Engineering": {
    "jobTitle": "Vice President & Treasurer @",
    "duration": "August 2020 - May 2023",
    "location": "Blacksburg, VA",
    "desc": [
      "Managed a student organization focused on microcontrollers and programming principles for diverse technical backgrounds.",
      "Delivered a positive learning experience for members, resulting in a ~75% growth in membership.",
      "Recruited 4 new officers, formed an executive board, and secured a faculty adviser for the club."
    ]
  }
}
